utn-fra-lse/lpc845/ejemplos/lpc845_breakout_board/src/fsl_component_timer_manager.c
        osaStatus = OSA_SemaphoreCreate((osa_semaphore_handle_t)s_timermanager.halTimerTaskSemaphoreHandle, 1U);
        assert(KOSA_StatusSuccess == (osa_status_t)osaStatus);
        (void)osaStatus;

        osaStatus = OSA_TaskCreate((osa_task_handle_t)s_timermanager.timerTaskHandle, OSA_TASK(TimerManagerTask), NULL);
        assert(KOSA_StatusSuccess == (osa_status_t)osaStatus);
        (void)osaStatus;
#endif
#endif
#if (defined(TM_ENABLE_TIME_STAMP) && (TM_ENABLE_TIME_STAMP > 0U))
        halTimeStampConfig.srcClock_Hz    = timerConfig->timeStampSrcClock_Hz;
        halTimeStampConfig.instance       = timerConfig->timeStampInstance;
        halTimeStampConfig.clockSrcSelect = timerConfig->clockSrcSelect;
        HAL_TimeStampInit(halTimeStampHandle, &halTimeStampConfig);
#endif
        s_timermanager.initialized = 1U;
    }
    return kStatus_TimerSuccess;
}

/*!
 * @brief Deinitialize timer manager module.
 *
 */
void TM_Deinit(void)
{
#if defined(OSA_USED)
#if (defined(TM_COMMON_TASK_ENABLE) && (TM_COMMON_TASK_ENABLE > 0U))
#else
    (void)OSA_SemaphoreDestroy((osa_semaphore_handle_t)s_timermanager.halTimerTaskSemaphoreHandle);
    (void)OSA_TaskDestroy((osa_task_handle_t)s_timermanager.timerTaskHandle);
#endif
#endif
    HAL_TimerDeinit((hal_timer_handle_t)s_timermanager.halTimerHandle);
    (void)memset(&s_timermanager, 0x0, sizeof(s_timermanager));
}

/*!
 * @brief Power up timer manager module.
 *
 */
void TM_ExitLowpower(void)
{
    uint32_t remainingUs;

#if (defined(TM_ENABLE_LOW_POWER_TIMER) && (TM_ENABLE_LOW_POWER_TIMER > 0U))
    HAL_TimerExitLowpower((hal_timer_handle_t)s_timermanager.halTimerHandle);
#endif
#if (defined(TM_ENABLE_TIME_STAMP) && (TM_ENABLE_TIME_STAMP > 0U))
    HAL_TimeStampExitLowpower(s_timermanager.halTimerHandle);
#endif

    remainingUs = HAL_TimerGetCurrentTimerCount((hal_timer_handle_t)s_timermanager.halTimerHandle);
    TimersUpdateSyncTask(remainingUs);
    s_timermanager.previousTimeInUs = remainingUs;
}

/*!
 * @brief Power down timer manager module.
 *
 */
void TM_EnterLowpower(void)
{
    uint32_t remainingUs;

    /* Sync directly the timer manager ressources while bypassing the task
     * This allows to update the timer manager ressources (timebase, timers, ...) under masked interrupts
     * and make sure all timers are processed correctly */
    remainingUs = HAL_TimerGetCurrentTimerCount((hal_timer_handle_t)s_timermanager.halTimerHandle);
    TimersUpdateDirectSync(remainingUs);
    s_timermanager.previousTimeInUs = remainingUs;

#if (defined(TM_ENABLE_LOW_POWER_TIMER) && (TM_ENABLE_LOW_POWER_TIMER > 0U))
    HAL_TimerEnterLowpower((hal_timer_handle_t)s_timermanager.halTimerHandle);
#endif
}

/*!
 * @brief Programs a timer needed for RTOS tickless low power period
 *
 * @param timerHandle    the handle of the timer
 * @param timerTimeout   The timer timeout in microseconds unit
 *
 */
void TM_EnterTickless(timer_handle_t timerHandle, uint64_t timerTimeout)
{
    timer_handle_struct_t *th = timerHandle;
    uint8_t timerType         = (uint8_t)kTimerModeSingleShot;
    uint32_t remainingUs;

    assert(timerHandle);

    uint32_t regPrimask = DisableGlobalIRQ();

    if (timerTimeout > 0U)
    {
        /* Set current timer as a single shot timer */
        TimerSetTimerType(timerHandle, timerType);

        /* Register timeout */
        th->timeoutInUs = timerTimeout;
        th->remainingUs = timerTimeout;

        /* Enable timer */
        ++s_timermanager.numberOfActiveTimers;
        TimerSetTimerStatus(timerHandle, (uint8_t)kTimerStateReady_c);
    }

    /* Sync directly the timer manager ressources while bypassing the task
     * This allows to start a timer before going to low power and under masked
     * interrupts
     * This should guarantuee that the device will wake up at the latest in
     * timerTimeout usec */
    remainingUs = HAL_TimerGetCurrentTimerCount((hal_timer_handle_t)s_timermanager.halTimerHandle);
    TimersUpdateDirectSync(remainingUs);
    s_timermanager.previousTimeInUs = remainingUs;

    EnableGlobalIRQ(regPrimask);
}

/*!
 * @brief Resyncs timer manager ressources after tickless low power period
 *
 * @param timerHandle    the handle of the timer
 *
 */
void TM_ExitTickless(timer_handle_t timerHandle)
{
    uint32_t remainingUs;

    assert(timerHandle);

    uint32_t regPrimask = DisableGlobalIRQ();

    /* Stop timer */
    (void)TimerStop(timerHandle);

    remainingUs = HAL_TimerGetCurrentTimerCount((hal_timer_handle_t)s_timermanager.halTimerHandle);
    TimersUpdateSyncTask(remainingUs);
    s_timermanager.previousTimeInUs = remainingUs;

    EnableGlobalIRQ(regPrimask);
}

/*!
 * @brief Get a time-stamp value
 *
 */
uint64_t TM_GetTimestamp(void)
{
#if (defined(TM_ENABLE_TIME_STAMP) && (TM_ENABLE_TIME_STAMP > 0U))
    return HAL_GetTimeStamp((hal_time_stamp_handle_t)s_timermanager.halTimeStampHandle);
#else
    return HAL_TimerGetCurrentTimerCount((hal_timer_handle_t)s_timermanager.halTimerHandle);
#endif /* TM_ENABLE_TIME_STAMP */
}

/*!
 * @brief Open a timer with user handle.
 *
 * @param timerHandle              Pointer to point to a memory space of size #TIMER_HANDLE_SIZE allocated by the
 * caller.
 * @retval kStatus_TimerSuccess    Timer open succeed.
 * @retval kStatus_TimerError      An error occurred.
 */
timer_status_t TM_Open(timer_handle_t timerHandle)
{
    timer_handle_struct_t *timerState = timerHandle;
    timer_handle_struct_t *th;
    assert(sizeof(timer_handle_struct_t) == TIMER_HANDLE_SIZE);
    assert(timerHandle);
    TIMER_ENTER_CRITICAL();
    th = s_timermanager.timerHead;
    while (th != NULL)
    {
        /* Determine if timer element is already in list */
        if (th == timerState)
        {
            assert(0);
            TIMER_EXIT_CRITICAL();
            return kStatus_TimerSuccess;
        }
        th = th->next;
    }
    TimerSetTimerStatus(timerState, (uint8_t)kTimerStateInactive_c);

